package ua.com.compose.other_text_style.utils

interface Converter {
    fun convertSymbol(oldSymbol: Char, pack: Int = 0): String
    fun convertString(string: String, pack: Int = 0): String
    fun size(): Int
}

class EnglishConverter: Converter {
    private val originStr = "1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ"

    private val symbolMap = mutableMapOf<Char, Int>().apply {
        originStr.forEachIndexed { index, char ->
            this[char] = index
        }
    }

    fun addTranslMap(){
        symbolMap['А'] = 36
    }

    private val packAlternative = arrayOf(
            arrayOf("❶","❷","❸","❹","❺","❻","❼","❽","❾","⓿",
                    "🅐","🅑","🅒","🅓","🅔","🅕","🅖","🅗","🅘",
                    "🅙","🅚","🅛","🅜","🅝","🅞","🅟","🅠","🅡",
                    "🅢","🅣","🅤","🅥","🅦","🅧","🅨","🅩"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "🅰","🅱","🅲","🅳","🅴","🅵","🅶","🅷","🅸",
                    "🅹","🅺","🅻","🅼","🅽","🅾","🅿","🆀","🆁",
                    "🆂","🆃","🆄","🆅","🆆","🆇","🆈","🆉"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "Ꮧ","Ᏸ","ፈ","Ꮄ","Ꮛ","Ꭶ","Ꮆ","Ꮒ","Ꭵ",
                    "Ꮰ","Ꮶ","Ꮭ","Ꮇ","Ꮑ","Ꭷ","Ꭾ","Ꭴ","Ꮢ",
                    "Ꮥ","Ꮦ","Ꮼ","Ꮙ","Ꮗ","ጀ","Ꭹ","ሮ"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "🄰","🄱","🄲","🄳","🄴","🄵","🄶","🄷","🄸",
                    "🄹","🄺","🄻","🄼","🄽","🄾","🄿","🅀","🅁",
                    "🅂","🅃","🅄","🅅","🅆","🅇","🅈","🅉"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "⒜","⒝","⒞","⒟","⒠","⒡","⒢","⒣","⒤",
                    "⒥","⒦","⒧","⒨","⒩","⒪","⒫","⒬","⒭",
                    "⒮","⒯","⒰","⒱","⒲","⒳","⒴","⒵"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "【a】","【b】","【c】","【d】","【e】","【f】","【g】","【h】","【i】",
                    "【j】","【k】","【l】","【m】","【n】","【o】","【p】","【q】","【r】",
                    "【s】","【t】","【u】","【v】","【w】","【x】","【y】","【z】"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "ᗩ","ᗷ","ᑕ","ᗪ","E","ᖴ","G","ᕼ","I",
                    "ᒍ","K","ᒪ","ᗰ","ᑎ","O","ᑭ","ᑫ","ᖇ",
                    "ᔕ","T","ᑌ","ᐯ","ᗯ","᙭","Y","ᘔ"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "a̲","b̲","c̲","d̲","e̲","f̲","g̲","h̲","i̲",
                    "j̲","k̲","l̲","m̲","n̲","o̲","p̲","q̲","r̲",
                    "s̲","t̲","u̲","v̲","w̲","x̲","y̲","z̲"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "̶a","̶b","̶c","̶d","̶e","̶f","̶g","̶h","̶i",
                    "̶j","̶k","̶l","̶m","̶n","̶o","̶p","̶q","̶r",
                    "̶s","̶t","̶u","̶v","̶w","̶x","̶y","̶z"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "ⓐ","ⓑ","ⓒ","ⓓ","ⓔ","ⓕ","ⓖ","ⓗ","ⓘ",
                    "ⓙ","ⓚ","ⓛ","ⓜ","ⓝ","ⓞ","ⓟ","ⓠ","ⓡ",
                    "ⓢ","ⓣ","ⓤ","ⓥ","ⓦ","ⓧ","ⓨ","ⓩ"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "╭a╮","╭b╮","╭c╮","╭d╮","╭e╮","╭f╮","╭g╮","╭h╮","╭i╮",
                    "╭j╮","╭k╮","╭l╮","╭m╮","╭n╮","╭o╮","╭p╮","╭q╮","╭r╮",
                    "╭s╮","╭t╮","╭u╮","╭v╮","╭w╮","╭x╮","╭y╮","╭z╮"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "≼a≽","≼b≽","≼c≽","≼d≽","≼e≽","≼f≽","≼g≽","≼h≽","≼i≽",
                    "≼j≽","≼k≽","≼l≽","≼m≽","≼n≽","≼o≽","≼p≽","≼q≽","≼r≽",
                    "≼s≽","≼t≽","≼u≽","≼v≽","≼w≽","≼x≽","≼y≽","≼z≽"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "『a』","『b』","『c』","『d』","『e』","『f』","『g』","『h』","『i』",
                    "『j』","『k』","『l』","『m』","『n』","『o』","『p』","『q』","『r』",
                    "『s』","『t』","『u』","『v』","『w』","『x』","『y』","『z』"),

            arrayOf("１","２","３","４","５","６","７","８","９","０",
                    "Ａ","Ｂ","Ｃ","Ｄ","Ｅ","Ｆ","Ｇ","Ｈ","Ｉ",
                    "Ｊ","Ｋ","Ｌ", "Ｍ","Ｎ","Ｏ","Ｐ","Ｑ","Ｒ",
                    "Ｓ","Ｔ","Ｕ","Ｖ","Ｗ","Ｘ","Ｙ","Ｚ"),

            arrayOf("𝟙","𝟚","𝟛","𝟜","𝟝","𝟞","𝟟","𝟠","𝟡","𝟘",
                    "𝔸","𝔹","ℂ","𝔻","𝔼","𝔽","𝔾","ℍ","𝕀",
                    "𝕁","𝕂","𝕃","𝕄","ℕ","𝕆","ℙ","ℚ","ℝ",
                    "𝕊","𝕋","𝕌","𝕍","𝕎","𝕏","𝕐","ℤ"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "𝕬","𝕭","𝕮","𝕯","𝕰","𝕱","𝕲","𝕳","𝕴",
                    "𝕵","𝕶","𝕷","𝕸","𝕹","𝕺","𝕻","𝕼","𝕽",
                    "𝕾","𝕿","𝖀","𝖁","𝖂","𝖃","𝖄","𝖅"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "𝘼","𝘽","𝘾","𝘿","𝙀","𝙁","𝙂","𝙃","𝙄",
                    "𝙅","𝙆","𝙇","𝙈","𝙉","𝙊","𝙋","𝙌","𝙍",
                    "𝙎","𝙏","𝙐","𝙑","𝙒","𝙓","𝙔","𝙕"),

            arrayOf("1̨̹̦͍̀","2̷́̃̉̕","3̤̰̺̂̃","4̶̣̠̖̳","5̷̧̼́͌","6͙̜̤ͩ̆","7̸̹̲ͮ̒","8̯̭̓̇͂","9͉̳ͬ̃ͥ","0̗̜͕̅̃",
                    "A̷͙ͭͫ̕","B̩͎͍̾ͅ","C̵͉͋̔͞","D̶͔̭̪̻","Ḛͭ̉̇͟","F̘͍͖ͫ͘","G̩̱ͩ̏͜","Hͥ̽ͣ̃̔","I̍̅̀̎̊",
                    "J̶̳̀́̃","K͕͓͌̎̾","L̸̖̽̌͂","M͉̅ͮ͒ͤ","N̺̻̔̆ͅ","O̖̼ͩ͌͐","P̧͕̒̊͘","Q̦̭̀̾͜","R͉̜̎͡͠",
                    "S̵̙͕̀̃","T̨͈͗̌ͥ","U̠҉̷̙ͦ","V̘̪͆̂̅","W̯ͤ̾ͣ͝","X̵̹̬̄̽","Ỵ̛̖͋͢","Z̟̈́̆̉͜"),

            arrayOf("1","2","3","4","5","6","7","8","9","0",
                    "𝒜","𝐵","𝒞","𝒟","𝐸","𝐹","𝒢","𝐻","𝐼",
                    "𝒥","𝒦","𝐿","𝑀","𝒩","𝒪","𝒫","𝒬","𝑅",
                    "𝒮","𝒯","𝒰","𝒱","𝒲","𝒳","𝒴","𝒵"),

            arrayOf("1͓̽","2͓̽","3͓̽","4͓̽","5͓̽","6͓̽","7͓̽","8͓̽","9͓̽","0͓̽",
                    "A͓̽","B͓̽","C͓̽","D͓̽","E͓̽","F͓̽","G͓̽","H͓̽","I͓̽",
                    "J͓̽","K͓̽","L͓̽","M͓̽","N͓̽","O͓̽","P͓̽","Q͓̽","R͓̽",
                    "S͓̽","T͓̽","U͓̽","V͓̽","W͓̽","X͓̽","Y͓̽","Z͓̽"),

            arrayOf("1҉","2҉","3҉","4҉","5҉","6҉","7҉","8҉","9҉","0҉",
                    "A҉","B҉","C҉","D҉","E҉","F҉","G҉","H҉","I҉",
                    "J҉","K҉","L҉","M҉","N҉","O҉","P҉","Q҉","R҉",
                    "S҉","T҉","U҉","V҉","W҉","X҉","Y҉","Z҉"),

            arrayOf("𝟏","𝟐","𝟑","𝟒","𝟓","𝟔","𝟕","𝟖","𝟗","𝟎",
                    "𝐀","𝐁","𝐂","𝐃","𝐄","𝐅","𝐆","𝐇","𝐈",
                    "𝐉","𝐊","𝐋","𝐌","𝐍","𝐎","𝐏","𝐐","𝐑",
                    "𝐒","𝐓","𝐔","𝐕","𝐖","𝐗","𝐘","𝐙"),

            arrayOf("1̤̈̈","2̤̈̈","3̤̈̈","4̤̈̈","5̤̈̈","6̤̈̈","7̤̈̈","8̤̈̈","9̤̤̈","0̤̈̈",
                    "Ä̤̈","B̤̈̈","C̤̈̈","D̤̈̈","Ë̤̈","F̤̈̈","G̤̈̈","Ḧ̤̈","Ï̤̈",
                    "J̤̈̈","K̤̈̈","L̤̈̈","M̤̈̈","N̤̈̈","Ö̤̈","P̤̈̈","Q̤̈̈","R̤̈̈",
                    "S̤̈̈","T̤̈̈","Ṳ̈̈","V̤̈̈","Ẅ̤̈","Ẍ̤̈","Ÿ̤̈","Z̤̈̈"),

            arrayOf("1͟","2͟","3͟","4͟","5͟","6͟","7͟","8͟","9͟","0͟",
                    "A͟","B͟","C͟","D͟","E͟","F͟","G͟","H͟","I͟",
                    "J͟","K͟","L͟","M͟","N͟","O͟","P͟","Q͟","R͟",
                    "S͟","T͟","U͟","V͟","W͟","X͟","Y͟","Z͟"),

            arrayOf("░1░","░2░","░3░","░4░","░5░","░6░","░7░","░8░","░9░","░0░",
                    "░A░","░B░","░C░","░D░","░E░","░F░","░G░","░H░","░I░",
                    "░J░","░K░","░L░","░M░","░N░","░O░","░P░","░Q░","░R░",
                    "░S░","░T░","░U░","░V░","░W░","░X░","░Y░","░Z░")
    )

    override fun size(): Int {
        return packAlternative.size
    }

    override fun convertSymbol(oldSymbol: Char, pack: Int): String {
        val oldChar = oldSymbol.toUpperCase()
        if(pack > size()){
            return oldChar.toString()
        }
        val oldSymbolIndex = symbolMap[oldChar] ?: return oldChar.toString()
        return packAlternative[pack][oldSymbolIndex]
    }

    override fun convertString(string: String, pack: Int): String {
        val oldString = string.toUpperCase()
        if(pack > size()){
            return oldString
        }
        val stringBuffer = StringBuffer()
        oldString.forEach { oldSymbol ->
            val oldSymbolIndex = symbolMap[oldSymbol]
            if(oldSymbolIndex != null){
                stringBuffer.append(packAlternative[pack][oldSymbolIndex])
            }else{
                stringBuffer.append(oldSymbol)
            }
        }
        return stringBuffer.toString()
    }
}

class TextStyleConverter {
    companion object{
        fun createConverter() = EnglishConverter()
    }
}